DS4P/access-control-service/bl/pep-service-bl/src/test/resources/securedFilterC32fullSOAPMessage.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <S:Header>
        <To xmlns="http://www.w3.org/2005/08/addressing"
            >http://xds-demo.feisystems.com/Pep/services/securedfilterc32service?wsdl</To>
        <Action xmlns="http://www.w3.org/2005/08/addressing"
            >http://www.samhsa.gov/ds4ppilot/contract/securedpep/SecuredFilterC32ServicePortType/RegisteryStoredQueryRequest</Action>
        <ReplyTo xmlns="http://www.w3.org/2005/08/addressing"> 09:29:40,288 INFO [stdout]
            (http--0.0.0.0-80-2) <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
            09:29:40,289 INFO [stdout] (http--0.0.0.0-80-2) </ReplyTo>
        <MessageID xmlns="http://www.w3.org/2005/08/addressing"
            >uuid:37a42f03-1345-4d1d-b317-88b5d68bacaa</MessageID>
        <wsse:Security S:mustUnderstand="1">
            <wsu:Timestamp xmlns:ns16="http://www.w3.org/2003/05/soap-envelope"
                xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
                wsu:Id="_3">
                <wsu:Created>2013-02-11T17:27:45Z</wsu:Created>
                <wsu:Expires>2013-02-11T17:32:45Z</wsu:Expires>
            </wsu:Timestamp>
            <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
                xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
                ID="b66454b2-6262-4dca-832b-23d53ca4afb3"
                IssueInstant="2013-02-11T12:27:45.226-05:00" Version="2.0">
                <saml2:Issuer Format="urn:oasis:names:tc:SAML:2.0:nameid-format:X509SubjectName"
                    >CN=DrDuane,OU=HIG,O=Dept. of Veterans
                    Affairs,L=Missoula,ST=MT,C=US</saml2:Issuer>
                <ds:Signature>
                    <ds:SignedInfo>
                        <ds:CanonicalizationMethod
                            Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                        <ds:Reference URI="#b66454b2-6262-4dca-832b-23d53ca4afb3">
                            <ds:Transforms>
                                <ds:Transform
                                    Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                            </ds:Transforms>
                            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                            <ds:DigestValue>KvIfdrOD7i2BlEycGdhbE9K3cbU=</ds:DigestValue>
                        </ds:Reference>
                    </ds:SignedInfo>
                    <ds:SignatureValue>WdNNKIAhpybYXAbDPHY2YTy3LlY0zX4A+bLtFQRRLPFzoefhaBOiG4ZrVv5d1dr8aj72Qlq+HUtU
                        09:29:40,302 INFO [stdout] (http--0.0.0.0-80-2)
                        AUr/3WDzTDk6eaGqei94/m+PRFolmNUrhTEXAQxbn1Zf6kJpQvn7hOJaYXDpxWUneH2Z7NsYrsfs
                        09:29:40,304 INFO [stdout] (http--0.0.0.0-80-2)
                        TeSh76ec2bMvuVDFTVV6aVmwT2bk6Ea37DvnCqyc30sqX0qtn9JwA2RpccWmPFOemu+x0ogeWX0C
                        09:29:40,305 INFO [stdout] (http--0.0.0.0-80-2)
                        8jD3/nQlRGhzAYJ91THmOkdGeM+kEU4+KPvnnza/sJtVyKzQ3sVjZkl5nAZDXXcUyqWTuBJEQXkD
                        09:29:40,306 INFO [stdout] (http--0.0.0.0-80-2)
                        BQarf7mEkPUoCqVUZz35G55Iwg76YzFj2ecz/A==</ds:SignatureValue>
                    <ds:KeyInfo>
                        <ds:KeyValue>
                            <ds:RSAKeyValue>
                                <ds:Modulus>jVISWLdyRjjdp5mHeLcUUeE8q146MRHglAYiscqhUrS4mUspPEIAUEyZhTtkTNj7wu2F9VBoi4Xr
                                    09:29:40,309 INFO [stdout] (http--0.0.0.0-80-2)
                                    8EsqtfzBZNTDTufFOdf7agK7aNQZ63Y71L84TpD570XJ4FJ8+FrEbOUmfmKGW2wDh5lZbskSrSOi
                                    09:29:40,310 INFO [stdout] (http--0.0.0.0-80-2)
                                    hjwaLTiVUJ97g5m+A7kVSsYxFoeNhJ5N2FA2h+Ertxz22XqAR49B+HhM9rj72zZvT0iEugFKdW9i
                                    09:29:40,311 INFO [stdout] (http--0.0.0.0-80-2)
                                    XIVvBR/chNPHThHQ//LDHKUZ5pgB5opl66NNKDQQyGEpiEo1slERlhxrwAHciAc8+ewFyVTKBL3R
                                    09:29:40,312 INFO [stdout] (http--0.0.0.0-80-2)
                                    5W7RvGwLaEHdStOWvf9F31OF/q+oAP783SNJQQ==</ds:Modulus>
                                <ds:Exponent>AQAB</ds:Exponent>
                            </ds:RSAKeyValue>
                        </ds:KeyValue>
                    </ds:KeyInfo>
                </ds:Signature>
                <saml2:Subject>
                    <saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:X509SubjectName"
                        >CN=DrDuane,OU=HIG,O=Dept. of Veterans
                        Affairs,L=Missoula,ST=MT,C=US</saml2:NameID>
                    <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
                        <saml2:NameID
                            Format="urn:oasis:names:tc:SAML:2.0:nameid-format:X509SubjectName"
                            >CN=DrDuane,OU=HIG,O=Dept. of Veterans
                            Affairs,L=Missoula,ST=MT,C=US</saml2:NameID>
                        <saml2:SubjectConfirmationData>
                            <ds:KeyInfo> 09:29:40,320 INFO [stdout] (http--0.0.0.0-80-2)
                                    <ds:KeyValue> 09:29:40,321 INFO [stdout] (http--0.0.0.0-80-2)
                                            <ds:RSAKeyValue><ds:Modulus>jVISWLdyRjjdp5mHeLcUUeE8q146MRHglAYiscqhUrS4mUspPEIAUEyZhTtkTNj7wu2F9VBoi4Xr8EsqtfzBZNTDTufFOdf7agK7aNQZ63Y71L84TpD570XJ4FJ8+FrEbOUmfmKGW2wDh5lZbskSrSOihjwaLTiVUJ97g5m+A7kVSsYxFoeNhJ5N2FA2h+Ertxz22XqAR49B+HhM9rj72zZvT0iEugFKdW9iXIVvBR/chNPHThHQ//LDHKUZ5pgB5opl66NNKDQQyGEpiEo1slERlhxrwAHciAc8+ewFyVTKBL3R5W7RvGwLaEHdStOWvf9F31OF/q+oAP783SNJQQ==</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue>
                                    09:29:40,324 INFO [stdout] (http--0.0.0.0-80-2) </ds:KeyValue>
                                09:29:40,325 INFO [stdout] (http--0.0.0.0-80-2) </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                </saml2:Subject>
                <saml2:Conditions NotBefore="2013-02-10T12:27:45.226-05:00"
                    NotOnOrAfter="2013-02-16T12:27:45.226-05:00"/>
                <saml2:AttributeStatement>
                    <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:subject-id">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >Duane_Decouteau@direct.healthvault-stage.com</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:locality">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >2.16.840.1.113883.4.349</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >MD/Allopath</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >TREAT</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute
                        Name="urn:oasis:names:tc:xspa:2.0:subject:sensitivity:privileges">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >ETH</saml2:AttributeValue>
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >PSY</saml2:AttributeValue>
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >HIV</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute Name="urn:gov:hhs:fha:nhinc:service-type">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >DocumentQuery</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >PUI100010060001</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute Name="urn:oasis:names:tc:xspa:2.0:resource:type">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >C32</saml2:AttributeValue>
                    </saml2:Attribute>
                    <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:action:action-id">
                        <saml2:AttributeValue xmlns:ns6="http://www.w3.org/2001/XMLSchema-instance"
                            xmlns:ns7="http://www.w3.org/2001/XMLSchema" ns6:type="ns7:string"
                            >Execute</saml2:AttributeValue>
                    </saml2:Attribute>
                </saml2:AttributeStatement>
            </saml2:Assertion>
            <ds:Signature xmlns:ns16="http://www.w3.org/2003/05/soap-envelope"
                xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" Id="_1">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <exc14n:InclusiveNamespaces PrefixList="wsse S"/>
                    </ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#_3">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <exc14n:InclusiveNamespaces PrefixList="wsu wsse S"/>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>9noRbmexhYgYK3mYkLGObO62ypw=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>VxChEbMywsk2P60Zy/xOW6nAXhCQ3XmqA7z9vG8nWMhQsuuNOG00o3Ux6AfDFz/S7T+tW3uuSVksN4zegmGcSWozNXu+Q+N9nnI7kBiBWQTjIa5sc2LFsMcRO2wNZKioy8TD3WRTM2hXKt1E7hQ2Ze0Ld3p8J8UUzZusBu/sTxbybq9gslIVH8p1BaI8ZScX6ig/LZqA29Ev50DSFRUh0UBHRbJ6J8+XwE1S7VXh9SIbd6FoQPeo7gx8IUkRB087+8cJ3XNbZxIILwNibRSQup7ZloUyIBGapcUsQ+1BsNYVI7Sj5YhByqvUWlvL3keAmpgbOAuMN2cIb8Z/AjGjuQ==</ds:SignatureValue>
                <ds:KeyInfo>
                    <wsse:SecurityTokenReference
                        wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0">
                        <wsse:KeyIdentifier
                            ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID"
                            >b66454b2-6262-4dca-832b-23d53ca4afb3</wsse:KeyIdentifier>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </S:Header>
    <S:Body>
        <ns2:RegisteryStoredQueryRequest
            xmlns:ns2="http://www.samhsa.gov/ds4ppilot/schema/securedpep">
            <patientId>PUI100010060001^^^&amp;2.16.840.1.113883.3.467&amp;ISO</patientId>
            <messageId>b66454b2-6262-4dca-832b-23d53ca4afb3</messageId>
        </ns2:RegisteryStoredQueryRequest>
    </S:Body>
</S:Envelope>
